In [ ]:
import pandas as pd

In [ ]:
data = pd.read_csv('/content/drive/My Drive/GOOGLE COLAB SEMESTER 7/eksport.csv')

In [ ]:
from sklearn.tree import DecisionTreeClassifier 
from sklearn import metrics
from sklearn.model_selection import train_test_split

In [ ]:
data

     Unnamed: 0  Survived  Pclass  ... Embarked    Title  PassengerType
0             0         0       3  ...        S       Mr              4
1             1         1       1  ...        C      Mrs              4
2             2         1       3  ...        S     Miss              4
3             3         1       1  ...        S      Mrs              4
4             4         0       3  ...        S       Mr              4
..          ...       ...     ...  ...      ...      ...            ...
886         886         0       2  ...        S  Officer              4
887         887         1       1  ...        S     Miss              4
888         888         0       3  ...        S     Miss              2
889         889         1       1  ...        C       Mr              4
890         890         0       3  ...        Q       Mr              4

[891 rows x 14 columns]

In [ ]:
data.rename(columns={'Unnamed: 0':'Indeks'}, inplace=True)

In [ ]:
data

     Indeks  Survived  Pclass  ... Embarked    Title  PassengerType
0         0         0       3  ...        S       Mr              4
1         1         1       1  ...        C      Mrs              4
2         2         1       3  ...        S     Miss              4
3         3         1       1  ...        S      Mrs              4
4         4         0       3  ...        S       Mr              4
..      ...       ...     ...  ...      ...      ...            ...
886     886         0       2  ...        S  Officer              4
887     887         1       1  ...        S     Miss              4
888     888         0       3  ...        S     Miss              2
889     889         1       1  ...        C       Mr              4
890     890         0       3  ...        Q       Mr              4

[891 rows x 14 columns]

In [ ]:
data.isnull().sum()

Indeks             0
Survived           0
Pclass             0
Name               0
Sex                0
Age              177
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            687
Embarked           2
Title              2
PassengerType      0
dtype: int64

In [ ]:
print ('null: ', data['Ticket'].isnull().sum())
print('category:', data['Ticket'].value_counts().sum())

null:  0
category: 891

In [ ]:
print ('null: ', data['Cabin'].isnull().sum())
print('category:', data['Cabin'].value_counts().sum())

null:  687
category: 204

In [ ]:
null = data.columns[data.isnull().any()]
print(data[data["Title"].isnull()][null])
print(data[data["Embarked"].isnull()][null])

      Age Cabin Embarked Title
759  33.0   B77        S   NaN
822  38.0   NaN        S   NaN
      Age Cabin Embarked Title
61   38.0   B28      NaN  Miss
829  62.0   B28      NaN   Mrs

In [ ]:
data = data.drop([759, 822, 61, 829], axis=0)

In [ ]:
del data['Name']
del data['Ticket']
del data['Cabin']
del data['Age']

In [ ]:
title_map = {
    "Mr": 1,
    "Mrs": 1,
    "Miss": 1,
    "Master": 2,
    "Officer": 3,
    "Royalty": 4,
}
embarked_map = {
    "S": 1,
    "C": 2,
    "Q": 3,
}
data["Title"]=data["Title"].map(title_map)
data["Embarked"]=data["Embarked"].map(embarked_map)

In [ ]:
data

     Indeks  Survived  Pclass  Sex  ...     Fare  Embarked  Title  PassengerType
0         0         0       3    1  ...   7.2500         1      1              4
1         1         1       1    0  ...  71.2833         2      1              4
2         2         1       3    0  ...   7.9250         1      1              4
3         3         1       1    0  ...  53.1000         1      1              4
4         4         0       3    1  ...   8.0500         1      1              4
..      ...       ...     ...  ...  ...      ...       ...    ...            ...
886     886         0       2    1  ...  13.0000         1      3              4
887     887         1       1    0  ...  30.0000         1      1              4
888     888         0       3    0  ...  23.4500         1      1              2
889     889         1       1    1  ...  30.0000         2      1              4
890     890         0       3    1  ...   7.7500         3      1              4

[887 rows x 10 columns]

In [ ]:
data.isnull().sum()

Indeks           0
Survived         0
Pclass           0
Sex              0
SibSp            0
Parch            0
Fare             0
Embarked         0
Title            0
PassengerType    0
dtype: int64

In [ ]:
xdata = data.drop('Survived', axis=1)
ydata = data.Survived

In [ ]:
xtrain,xtest,ytrain,ytest=train_test_split(xdata,ydata,test_size=0.3, random_state=1)

In [ ]:
from sklearn.naive_bayes import GaussianNB
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis

In [ ]:
#Decision Tree Classifier
clf = DecisionTreeClassifier()
clf = clf.fit(xtrain,ytrain)
ypred = clf.predict(xtest)
print("Akurasi Decision Tree Classifier: ", metrics.accuracy_score(ytest, ypred)*100)

#Naive Beyes
nb = GaussianNB()
nb = nb.fit(xtrain, ytrain)
yprednb = nb.predict(xtest)
print("Akurasi Naive Beyes: ", metrics.accuracy_score(ytest, yprednb)*100)

#Linier Discriminant Analysis
lda= LinearDiscriminantAnalysis()
lda = lda.fit(xtrain, ytrain)
ypredlda = lda.predict(xtest)
print("Akurasi Linier Discriminant Analysis: ", metrics.accuracy_score(ytest, ypredlda)*100)

Akurasi Decision Tree Classifier:  74.53183520599251
Akurasi Naive Beyes:  81.27340823970037
Akurasi Linier Discriminant Analysis:  83.52059925093633